index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-01-26 Tue 11:16 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Forms of Business Organization</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Matt Brigida, Ph.D." />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Forms of Business Organization</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org71b7886">1. Sole Proprietorship</a></li>
<li><a href="#orgb5c529a">2. Partnership</a></li>
<li><a href="#orgb080950">3. Corporation</a>
<ul>
<li><a href="#orgdca4387">3.1. Foreign Corporations</a></li>
</ul>
</li>
<li><a href="#orgd5c21c1">4. Balance</a></li>
<li><a href="#orgfe4ae8a">5. Corporations and Financial Markets</a>
<ul>
<li><a href="#org7cb04c3">5.1. Primary Markets vs Secondary Markets</a></li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-org71b7886" class="outline-2">
<h2 id="org71b7886"><span class="section-number-2">1</span> Sole Proprietorship</h2>
<div class="outline-text-2" id="text-1">
<p>
Benefits:
</p>
<ul class="org-ul">
<li>Since there is no distinction between the owner and the manager, income is only taxed once.</li>
<li>There is no agency problem (as there is no <b>agent</b>).</li>
</ul>

<p>
Costs:
</p>
<ul class="org-ul">
<li>Unlimited liability to the owner/manager.</li>
<li>Life of sole proprietorship is equivalent to the life of the owner.</li>
<li>Financing is limited to what the owner can invest and borrow.  Can't sell equity.</li>
<li>Transferring ownership means dissolving the proprietorship.</li>
</ul>
</div>
</div>


<div id="outline-container-orgb5c529a" class="outline-2">
<h2 id="orgb5c529a"><span class="section-number-2">2</span> Partnership</h2>
<div class="outline-text-2" id="text-2">
<p>
The benefits and costs of a partnership are the same as a sole proprietorship, except that there are many owners instead of one (which may cause a limited agency problem).  In practice there can be partners with limited liability, however we won't cover these other details of partnerships in this course. 
</p>
</div>
</div>

<div id="outline-container-orgb080950" class="outline-2">
<h2 id="orgb080950"><span class="section-number-2">3</span> Corporation</h2>
<div class="outline-text-2" id="text-3">
<p>
A corporation is a separate legal entity from the owner(s) (stockholders).  This shields the owners of the corporation from having to pay business debts&#x2014;debts of the corporation are <b>not</b> debts of the owners.  We say that stockholders have <b>limited liability</b>. 
</p>

<p>
Benefits:
</p>
<ul class="org-ul">
<li>Limited liability to the owners.</li>
<li>Infinitely lived.</li>
</ul>

<p>
Costs:
</p>
<ul class="org-ul">
<li>Since the owner and the manager are separate legal entities, income is taxed twice by the time it reaches the owner.</li>
<li>Ownership and management have been separated, and hence there is a substantial agency problem (cost).</li>
</ul>


<p>
Most businesses, as they grow, will become a corporation.
</p>

<blockquote>
<p>
You may hear some acting surprised about the double-taxation of corporations.
It is really a surprise?
</p>

<p>
A sole proprietorship is taxed once, but since the owner is the same legal entity as the business, the owner is also liable for business debts.  So the owner creates a <b>new</b> legal entity which is the business itself, and the owner is now not liable for the businesses debts. But since his is a separate legel entity, it has to pay taxes also.  
</p>

<p>
So double taxation wasn't created out of the blue, it is a consequence of obtaining limited liability for the owner. The owner can have single taxation whenever they want, they just have to assume the businesses debts. 
</p>
</blockquote>
</div>

<div id="outline-container-orgdca4387" class="outline-3">
<h3 id="orgdca4387"><span class="section-number-3">3.1</span> Foreign Corporations</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Legal systems and laws differ among countries, and so does the definition of a corporation.  Remember a corporation is a <i>legal entity</i> and this is specific to a jurisdiction.  The differing definition of a corporation between countries will be important in the next section where we define the <i>Goal of Financial Management</i>.
</p>
</div>
</div>
</div>

<div id="outline-container-orgd5c21c1" class="outline-2">
<h2 id="orgd5c21c1"><span class="section-number-2">4</span> Balance</h2>
<div class="outline-text-2" id="text-4">
<p>
So when a firm is deciding whether to take the corporate form, it weighs the benefits of the corporate form versus the costs.
</p>
</div>
</div>

<div id="outline-container-orgfe4ae8a" class="outline-2">
<h2 id="orgfe4ae8a"><span class="section-number-2">5</span> Corporations and Financial Markets</h2>
<div class="outline-text-2" id="text-5">
<p>
That the corporation is infinitely-lived facilitates selling equity (known as stock) and debt (notes and bonds) to finance the company's assets.  Securities (stock and bonds) are sold in <i>financial markets</i>.
</p>
</div>

<div id="outline-container-org7cb04c3" class="outline-3">
<h3 id="org7cb04c3"><span class="section-number-3">5.1</span> Primary Markets vs Secondary Markets</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Primary market transactions are those that involve the company, such as initial public offerings (IPO) or seasoned equity offerings (SEO).  In secondary markets, investors exchange securities among themselves, and the corporation itself is not part of the trade.  That does not mean the managers and owners of corporation are not interested however&#x2014;management compensation is commonly determined by secondary market security (mainly stock) prices.
</p>

<p>
We make a distinction between primary and secondary markets because their structure and participants are quite different.  Think of pricing an IPO where you don't have a publicly traded stock price to reference.  This can be quite difficult, and is often accomplished via <i>bookbuilding</i>.  This is where you go to various investors and ask what they would pay. Alternatively, you are valuing a stock in the secondary market, you already have a market clearing price available.
</p>

<p>
We will talk about stock and bond secondary market structure in later chapters, however here note that they are actively evolving.  Trading venues and mechanisms are vastly different today than they were 40 years ago, and they will likely be very different in 40 years.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Matt Brigida, Ph.D.</p>
<p class="date">Created: 2021-01-26 Tue 11:16</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
